fork-the-planet/rx-driver-package/source/r_ble_da14531_rx/r_ble_da1453x_rx_vx.xx/r_ble_da1453x_rx/src/hal_data.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2025 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : hal_data.c
 * Description  :
 *********************************************************************************************************************/
/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "hal_data.h"

ble_abs_instance_ctrl_t g_ble_abs0_ctrl;

static ble_abs_pairing_parameter_t gs_abs_pairing_param =
{ .io_capabilitie_local_device = BLE_CFG_IO_CAPABILITY,
  .mitm_protection_policy = BLE_CFG_MITM_PROTECTION,
  .secure_connection_only = BLE_CFG_SECURE_CONNECTIONS,
  .local_key_distribute = (uint8_t) (BLE_CFG_SECURITY_KEY_DIST | 0),
  .remote_key_distribute = (uint8_t) (BLE_CFG_SECURITY_KEY_DIST_PEER | 0),
  .maximum_key_size = BLE_CFG_MAX_LTK_SIZE, };

ble_abs_cfg_t g_ble_abs0_cfg =
{
    .gap_callback = gap_cb,
    .vendor_specific_callback = vs_cb,
	.p_pairing_parameter = &gs_abs_pairing_param,
    .p_gatt_server_callback_list = gs_abs_gatts_cb_param,
    .gatt_server_callback_list_number = 2,
    .p_gatt_client_callback_list = gs_abs_gattc_cb_param,
    .gatt_client_callback_list_number = 2,
    .p_callback = NULL,
	.p_context = (void*) NULL,
    .p_extend = NULL
};




